<?php

/*

Время намаза (muftyat.kz)
https://namaz.muftyat.kz/kk/namaz/api/

-----------------------------------------

require 'namazTime.php';

$lat = '43.238293'; // Широта
$lon = '76.945465'; // Долгота

$nt = new namazTime($lat, $lon);

// На сегодня
$data = $nt->getToday();

// На год
$data = $nt->getYear();

// Список городов казахстана
$data = namazTime::getCites();

echo '<pre>';
print_r($data);

*/

class namazTime
{
	public $lat;
	
	public $lon;
	
	public $year;
	
	public $today;
	
	public function __construct($lat = false, $lon = false, $year = false)
	{
		$this->lat = $lat ? $lat : '43.238293';
		$this->lon = $lon ? $lon : '76.945465';
		$this->year = $year ? $year : date('Y');
	}
	
	public function getToday()
	{
		$today = date('d-m-Y');
		
		$data = $this->getData();
		
		$result = [];
		
		$result['city'] = $data['city_name'];
		$result['date'] = $today;
		
		foreach ($data['result'] as $v) {
			if ($today == $v['date']) {
				$result['fajr'] = $v['Fajr'];
				$result['sunrise'] = $v['Sunrise'];
				$result['dhuhr'] = $v['Dhuhr'];
				$result['asr'] = $v['Asr'];
				$result['maghrib'] = $v['Maghrib'];
				$result['isha'] = $v['Isha'];
			}
		}
		
		return $result;
	}
	
	public function getYear()
	{
		$data = $this->getData();
		
		$result = [];
		$i = 0;
		
		$result['city'] = $data['city_name'];
		
		foreach ($data['result'] as $v) {
			$result['items'][$i]['date'] = $v['date'];
			$result['items'][$i]['fajr'] = $v['Fajr'];
			$result['items'][$i]['sunrise'] = $v['Sunrise'];
			$result['items'][$i]['dhuhr'] = $v['Dhuhr'];
			$result['items'][$i]['asr'] = $v['Asr'];
			$result['items'][$i]['maghrib'] = $v['Maghrib'];
			$result['items'][$i]['isha'] = $v['Isha'];
			$i++;
		}
		
		return $result;
	}
	
	private function getData()
	{
		$url = 'http://namaz.muftyat.kz/api/times/' . $this->year . '/' . $this->lat . '/' . $this->lon;
		
		return json_decode(file_get_contents($url), true);
	}
	
	public static function getCites()
	{
		$array = [
			['id' => '72', 'city' => 'Алматы', 'lat' => '43.238293', 'lon' => '76.945465', 'timezone' => '6'],
			['id' => '65', 'city' => 'Алтынсарин ауданы', 'lat' => '53.104086', 'lon' => '64.589965', 'timezone' => '6'],
			['id' => '112', 'city' => 'Алға', 'lat' => '50.076944', 'lon' => '58.284444', 'timezone' => '5'],
			['id' => '9', 'city' => 'Амангелді ауданы', 'lat' => '49.940951', 'lon' => '65.461268', 'timezone' => '6'],
			['id' => '71', 'city' => 'Арал', 'lat' => '46.8', 'lon' => '61.666667', 'timezone' => '5'],
			['id' => '41', 'city' => 'Арқалық', 'lat' => '50.248611', 'lon' => '66.911389', 'timezone' => '6'],
			['id' => '80', 'city' => 'Атасу ауылы', 'lat' => '48.500979', 'lon' => '71.078065', 'timezone' => '6'],
			['id' => '23', 'city' => 'Атбасар', 'lat' => '51.816667', 'lon' => '68.35', 'timezone' => '6'],
			['id' => '18', 'city' => 'Атырау', 'lat' => '47.116667', 'lon' => '51.883333', 'timezone' => '5'],
			['id' => '29', 'city' => 'Аягөз', 'lat' => '47.966667', 'lon' => '80.433333', 'timezone' => '6'],
			['id' => '59', 'city' => 'Ақсай', 'lat' => '51.10', 'lon' => '52.59', 'timezone' => '5'],
			['id' => '113', 'city' => 'Ақсу', 'lat' => '52.037890', 'lon' => '76.920582', 'timezone' => '6'],
			['id' => '47', 'city' => 'Ақтау', 'lat' => '43.635379', 'lon' => '51.169135', 'timezone' => '5'],
			['id' => '117', 'city' => 'Ақтоғай ауданы', 'lat' => '52.732339', 'lon' => '75.222892', 'timezone' => '6'],
			['id' => '20', 'city' => 'Ақтөбе', 'lat' => '50.3', 'lon' => '57.166667', 'timezone' => '5'],
			['id' => '120', 'city' => 'Аққулы ауданы', 'lat' => '51.508573', 'lon' => '78.303592', 'timezone' => '6'],
			['id' => '90', 'city' => 'Байғанин ауданы', 'lat' => '47.436554', 'lon' => '56.526355', 'timezone' => '5'],
			['id' => '44', 'city' => 'Байқоныр', 'lat' => '45.966111', 'lon' => '63.307778', 'timezone' => '5'],
			['id' => '36', 'city' => 'Балқаш', 'lat' => '46.5408', 'lon' => '74.8789', 'timezone' => '6'],
			['id' => '119', 'city' => 'Баянауыл ауданы', 'lat' => '50.803357', 'lon' => '75.489287', 'timezone' => '6'],
			['id' => '48', 'city' => 'Бейнеу', 'lat' => '45.322946', 'lon' => '55.188862', 'timezone' => '5'],
			['id' => '68', 'city' => 'Денис ауданы', 'lat' => '52.603040', 'lon' => '61.620629', 'timezone' => '6'],
			['id' => '52', 'city' => 'Екібастұз', 'lat' => '51.729778', 'lon' => '75.326583', 'timezone' => '6'],
			['id' => '93', 'city' => 'Ембі', 'lat' => '48.823344', 'lon' => '58.148397', 'timezone' => '5'],
			['id' => '116', 'city' => 'Ертіс ауданы', 'lat' => '53.295153', 'lon' => '74.586606', 'timezone' => '6'],
			['id' => '97', 'city' => 'Еңбекшіқазақ', 'lat' => '43.500438', 'lon' => '78.163706', 'timezone' => '6'],
			['id' => '106', 'city' => 'Жалағаш ауданы', 'lat' => '44.471530', 'lon' => '64.183298', 'timezone' => '5'],
			['id' => '11', 'city' => 'Жангелді ауданы', 'lat' => '49.699308', 'lon' => '63.631067', 'timezone' => '6'],
			['id' => '70', 'city' => 'Жаркент', 'lat' => '44.166667', 'lon' => '80.00', 'timezone' => '6'],
			['id' => '33', 'city' => 'Жаңатас', 'lat' => '43.566667', 'lon' => '69.75', 'timezone' => '6'],
			['id' => '108', 'city' => 'Жаңақорған ауданы', 'lat' => '43.492669', 'lon' => '67.154260', 'timezone' => '5'],
			['id' => '50', 'city' => 'Жаңаөзен', 'lat' => '43.343266', 'lon' => '52.865792', 'timezone' => '5'],
			['id' => '61', 'city' => 'Жаңқала', 'lat' => '49.215139', 'lon' => '50.303028', 'timezone' => '5'],
			['id' => '104', 'city' => 'Жезді кенті', 'lat' => '48.058857', 'lon' => '67.054870', 'timezone' => '6'],
			['id' => '38', 'city' => 'Жезқазған', 'lat' => '47.783333', 'lon' => '67.7', 'timezone' => '6'],
			['id' => '54', 'city' => 'Жетісай', 'lat' => '40.775278', 'lon' => '68.327222', 'timezone' => '6'],
			['id' => '99', 'city' => 'Жосалы', 'lat' => '45.488489', 'lon' => '64.086666', 'timezone' => '5'],
			['id' => '66', 'city' => 'Жітіқара ауданы ', 'lat' => '51.937054', 'lon' => '61.012478', 'timezone' => '6'],
			['id' => '37', 'city' => 'Жәйрем', 'lat' => '48.3375', 'lon' => '70.169167', 'timezone' => '6'],
			['id' => '62', 'city' => 'Жәнібек', 'lat' => '49.416667', 'lon' => '46.85', 'timezone' => '5'],
			['id' => '95', 'city' => 'Зайсан', 'lat' => '47.453008', 'lon' => '84.969846', 'timezone' => '6'],
			['id' => '98', 'city' => 'Индер', 'lat' => '48.299901', 'lon' => '51.398492', 'timezone' => '5'],
			['id' => '129', 'city' => 'Исатай ауданы', 'lat' => '47.381847', 'lon' => '50.381465', 'timezone' => '5'],
			['id' => '81', 'city' => 'Келес ауданы', 'lat' => '41.305597', 'lon' => '68.544861', 'timezone' => '6'],
			['id' => '100', 'city' => 'Кентау', 'lat' => '43.518131', 'lon' => '68.504652', 'timezone' => '6'],
			['id' => '128', 'city' => 'Курчатов', 'lat' => '50.754900', 'lon' => '78.544826', 'timezone' => '6'],
			['id' => '127', 'city' => 'Көкпекті ауданы', 'lat' => '48.687009', 'lon' => '82.892842', 'timezone' => '6'],
			['id' => '17', 'city' => 'Көкшетау', 'lat' => '53.291667', 'lon' => '69.391667', 'timezone' => '6'],
			['id' => '82', 'city' => 'Ленгер', 'lat' => '42.182051', 'lon' => '69.882120', 'timezone' => '6'],
			['id' => '69', 'city' => 'Лисаков', 'lat' => '52.544079', 'lon' => '62.492641', 'timezone' => '6'],
			['id' => '114', 'city' => 'Май ауданы', 'lat' => '51.030109', 'lon' => '77.498594', 'timezone' => '6'],
			['id' => '122', 'city' => 'Майқайын кенті', 'lat' => '51.458711', 'lon' => '75.796313', 'timezone' => '6'],
			['id' => '131', 'city' => 'Маханбет ауданы', 'lat' => '47.633313', 'lon' => '51.763577', 'timezone' => '5'],
			['id' => '28', 'city' => 'Мақат', 'lat' => '47.65', 'lon' => '53.316667', 'timezone' => '5'],
			['id' => '13', 'city' => 'Меңдіқара ауданы', 'lat' => '53.933550', 'lon' => '64.299378', 'timezone' => '6'],
			['id' => '4', 'city' => 'Миялы', 'lat' => '48.47', 'lon' => '53.47', 'timezone' => '5'],
			['id' => '92', 'city' => 'Мәртөк ауданы', 'lat' => '50.711441', 'lon' => '56.733892', 'timezone' => '5'],
			['id' => '14', 'city' => 'Науырзым ауданы ', 'lat' => '51.304292', 'lon' => '63.628399', 'timezone' => '6'],
			['id' => '3', 'city' => 'Нұр-Сұлтан', 'lat' => '51.133333', 'lon' => '71.433333', 'timezone' => '6'],
			['id' => '88', 'city' => 'Ойыл ауданы', 'lat' => '49.260606', 'lon' => '54.575097', 'timezone' => '5'],
			['id' => '7', 'city' => 'Орал', 'lat' => '51.204019', 'lon' => '51.370537', 'timezone' => '5'],
			['id' => '83', 'city' => 'Отырар ауданы', 'lat' => '42.666225', 'lon' => '67.497308', 'timezone' => '6'],
			['id' => '53', 'city' => 'Павлодар', 'lat' => '52.315556', 'lon' => '76.956389', 'timezone' => '6'],
			['id' => '51', 'city' => 'Петропавл', 'lat' => '54.862222', 'lon' => '69.140833', 'timezone' => '6'],
			['id' => '31', 'city' => 'Риддер', 'lat' => '50.35', 'lon' => '83.516667', 'timezone' => '6'],
			['id' => '43', 'city' => 'Рудный', 'lat' => '52.966667', 'lon' => '63.116667', 'timezone' => '6'],
			['id' => '84', 'city' => 'Сайрам ауданы', 'lat' => '42.403930', 'lon' => '69.875266', 'timezone' => '6'],
			['id' => '8', 'city' => 'Сайқын', 'lat' => '48.815278', 'lon' => '46.766944', 'timezone' => '5'],
			['id' => '55', 'city' => 'Сарыағаш', 'lat' => '41.466667', 'lon' => '69.166667', 'timezone' => '6'],
			['id' => '15', 'city' => 'Сарыкөл ауданы', 'lat' => '53.440801', 'lon' => '65.685604', 'timezone' => '6'],
			['id' => '19', 'city' => 'Сарыөзек', 'lat' => '44.356667', 'lon' => '77.969167', 'timezone' => '6'],
			['id' => '32', 'city' => 'Семей', 'lat' => '50.411111', 'lon' => '80.2275', 'timezone' => '6'],
			['id' => '111', 'city' => 'Созақ', 'lat' => '44.861720', 'lon' => '68.569600', 'timezone' => '6'],
			['id' => '85', 'city' => 'Созақ ауданы', 'lat' => '44.861720', 'lon' => '68.569600', 'timezone' => '6'],
			['id' => '121', 'city' => 'Солнечный', 'lat' => '52.034976', 'lon' => '75.462284', 'timezone' => '6'],
			['id' => '21', 'city' => 'Степногорск', 'lat' => '52.346944', 'lon' => '71.881667', 'timezone' => '6'],
			['id' => '105', 'city' => 'Сырым ауданы', 'lat' => '50.325986', 'lon' => '52.678107', 'timezone' => '5'],
			['id' => '40', 'city' => 'Сәтпаев', 'lat' => '47.9', 'lon' => '67.533333', 'timezone' => '6'],
			['id' => '103', 'city' => 'Тайынша', 'lat' => '53.852738', 'lon' => '69.782631', 'timezone' => '6'],
			['id' => '5', 'city' => 'Талдықорған', 'lat' => '45.016667', 'lon' => '78.366667', 'timezone' => '6'],
			['id' => '73', 'city' => 'Талғар', 'lat' => '43.302813', 'lon' => '77.239690', 'timezone' => '6'],
			['id' => '35', 'city' => 'Тараз', 'lat' => '42.883333', 'lon' => '71.366667', 'timezone' => '6'],
			['id' => '6', 'city' => 'Таран ауданы', 'lat' => '52.539620', 'lon' => '62.771083', 'timezone' => '6'],
			['id' => '109', 'city' => 'Теміртау', 'lat' => '50.058756', 'lon' => '72.953424', 'timezone' => '6'],
			['id' => '118', 'city' => 'Тереңкөл ауданы', 'lat' => '53.227323', 'lon' => '76.483156', 'timezone' => '6'],
			['id' => '107', 'city' => 'Тереңөзек кенті', 'lat' => '45.053372', 'lon' => '64.985412', 'timezone' => '5'],
			['id' => '86', 'city' => 'Түлкібас кенті', 'lat' => '42.493477', 'lon' => '70.290737', 'timezone' => '6'],
			['id' => '58', 'city' => 'Түркістан', 'lat' => '43.3', 'lon' => '68.243611', 'timezone' => '6'],
			['id' => '10', 'city' => 'Федеров ауданы', 'lat' => '53.692845', 'lon' => '62.851689', 'timezone' => '6'],
			['id' => '49', 'city' => 'Форт-Шевченко', 'lat' => '44.507463', 'lon' => '50.262833', 'timezone' => '5'],
			['id' => '25', 'city' => 'Хромтау', 'lat' => '50.250278', 'lon' => '58.434722', 'timezone' => '5'],
			['id' => '125', 'city' => 'Целиноград ауданы', 'lat' => '51.028562', 'lon' => '70.990677', 'timezone' => '6'],
			['id' => '60', 'city' => 'Чапаев', 'lat' => '50.182778', 'lon' => '51.175278', 'timezone' => '5'],
			['id' => '96', 'city' => 'Шал ақын ауданы', 'lat' => '53.785566', 'lon' => '67.379494', 'timezone' => '6'],
			['id' => '26', 'city' => 'Шалқар', 'lat' => '47.831392', 'lon' => '59.619290', 'timezone' => '5'],
			['id' => '102', 'city' => 'Шамалған ауылы', 'lat' => '43.189863', 'lon' => '76.534549', 'timezone' => '6'],
			['id' => '115', 'city' => 'Шарбақты ауданы', 'lat' => '52.335401', 'lon' => '78.302622', 'timezone' => '6'],
			['id' => '56', 'city' => 'Шардара', 'lat' => '41.254722', 'lon' => '67.969167', 'timezone' => '6'],
			['id' => '123', 'city' => 'Шаян', 'lat' => '43.032169', 'lon' => '69.381210', 'timezone' => '6'],
			['id' => '94', 'city' => 'Шиелі ауданы', 'lat' => '44.261740', 'lon' => '66.405891', 'timezone' => '5'],
			['id' => '77', 'city' => 'Шу', 'lat' => '43.611782', 'lon' => '73.760237', 'timezone' => '6'],
			['id' => '57', 'city' => 'Шымкент', 'lat' => '42.3', 'lon' => '69.6', 'timezone' => '6'],
			['id' => '76', 'city' => 'Шұбарқұдық', 'lat' => '49.202977', 'lon' => '56.563994', 'timezone' => '5'],
			['id' => '89', 'city' => 'Ырғыз ауданы', 'lat' => '48.481065', 'lon' => '62.151353', 'timezone' => '5'],
			['id' => '45', 'city' => 'Қазалы', 'lat' => '45.766667', 'lon' => '62.116667', 'timezone' => '5'],
			['id' => '101', 'city' => 'Қазығұрт', 'lat' => '41.862652', 'lon' => '69.579316', 'timezone' => '6'],
			['id' => '64', 'city' => 'Қамысты ауданы', 'lat' => '51.549566', 'lon' => '62.301561', 'timezone' => '6'],
			['id' => '24', 'city' => 'Қандыағаш', 'lat' => '49.474444', 'lon' => '57.423333', 'timezone' => '5'],
			['id' => '2', 'city' => 'Қапшағай', 'lat' => '43.883333', 'lon' => '77.083333', 'timezone' => '6'],
			['id' => '63', 'city' => 'Қарабалық ауданы', 'lat' => '53.599507', 'lon' => '61.769785', 'timezone' => '6'],
			['id' => '79', 'city' => 'Қаражал', 'lat' => '48.001042', 'lon' => '70.785762', 'timezone' => '6'],
			['id' => '12', 'city' => 'Қарасу ауданы', 'lat' => '52.341344', 'lon' => '65.392026', 'timezone' => '6'],
			['id' => '34', 'city' => 'Қаратау', 'lat' => '43.166667', 'lon' => '70.466667', 'timezone' => '6'],
			['id' => '39', 'city' => 'Қарағанды', 'lat' => '49.806406', 'lon' => '73.085485', 'timezone' => '6'],
			['id' => '87', 'city' => 'Қарғалы', 'lat' => '50.783970', 'lon' => '58.106976', 'timezone' => '5'],
			['id' => '75', 'city' => 'Қаскелең', 'lat' => '43.202449', 'lon' => '76.622278', 'timezone' => '6'],
			['id' => '91', 'city' => 'Қобда ауданы', 'lat' => '50.188476', 'lon' => '55.325909', 'timezone' => '5'],
			['id' => '78', 'city' => 'Қордай', 'lat' => '43.046040', 'lon' => '74.708076', 'timezone' => '6'],
			['id' => '42', 'city' => 'Қостанай', 'lat' => '53.219333', 'lon' => '63.634194', 'timezone' => '6'],
			['id' => '46', 'city' => 'Қызылорда', 'lat' => '44.85', 'lon' => '65.516667', 'timezone' => '5'],
			['id' => '27', 'city' => 'Құлсары', 'lat' => '46.983333', 'lon' => '54.016667', 'timezone' => '5'],
			['id' => '130', 'city' => 'Құрманғазы ауданы', 'lat' => '47.140203', 'lon' => '49.266377', 'timezone' => '5'],
			['id' => '22', 'city' => 'Үшарал', 'lat' => '46.169722', 'lon' => '80.939444', 'timezone' => '6'],
			['id' => '1', 'city' => 'Ұзынағаш', 'lat' => '43.220905', 'lon' => '76.314192', 'timezone' => '6'],
			['id' => '67', 'city' => 'Ұзынкөл ауданы ', 'lat' => '54.162521', 'lon' => '65.474446', 'timezone' => '6'],
			['id' => '126', 'city' => 'Ұржар ауданы', 'lat' => '46.974805', 'lon' => '81.462482', 'timezone' => '6'],
			['id' => '124', 'city' => 'Әйтеке би ауданы', 'lat' => '49.99', 'lon' => '60.87', 'timezone' => '5'],
			['id' => '16', 'city' => 'Әулиекөл ауданы', 'lat' => '52.224572', 'lon' => '63.920163', 'timezone' => '6'],
			['id' => '30', 'city' => 'Өскемен', 'lat' => '49.95', 'lon' => '82.616667', 'timezone' => '6'],
		];

		return $array;
	}
}
